---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TilePatternGridCellsX
source: html/173c36d1-e50d-0fd0-d946-9d9ac49fbd4e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TilePatternGridCellsX Property

"Number of horizontal cells"

## Syntax (C#)
```csharp
public static ForgeTypeId TilePatternGridCellsX { get; }
```